

<!DOCTYPE html>
<html lang="tr">
<head> 
		
		
  




                                 <a href="html-nedir"><h1 style="color:rgb(0, 186, 253);">WEB PROGRAMLAMA DERSİ</h1>
                                 <a href="html-nedir"><h2 style="color:rgb(0, 186, 253);">HTML</h2>

                                  <!-- Thumbnail -->
                                 <div class="bthumb2">
                                    <a href="html-nedir"><img src="images/html-nedir.jpg" alt="HTML Nedir?"  title="HTML Nedir?" class="img-responsive"></a>
                                 </div>
								 
<h2>
    HTML Nedir Ne İşe Yarar?
</h2>
<p>
Web dünyasının en önemli konularından biri olan ve bir anlamda vazgeçilmezi diyebileceğimiz bir konuyla karşınızdayız. Açılımı İngilizce olarak ‘    <em>Hyper Text Markup Language</em>’ olan ve ‘<em>Hiper Metin İşaretleme Dili</em>’ şeklinde Türkçe ifade edilen bir metin işaretleme dilidir. Yazımızın
    ilerleyen kısımlarında <strong>Html nedir kısaca</strong> bahsedeceğiz.
</p>
<p>
İnternet üzerinde kullanıcıların giriş yapmalarını sağlamak amacıyla web sayfaları oluşturmak için kullanılan bir betik dili olan    <strong>Html sayfası</strong> bulunduğu sunucularda ‘<em>.html</em>‘ veya ‘<em>.htm</em>‘ uzantılarıyla tutulur.
</p>
<p>
    Herhangi bir <strong>web sitesi</strong>ne giriş yapılınca sistemin bizi yönlendirdiği sayfa, siteye giriş sayfası olarak tanımlanır. Bahsedilen bu
    sayfanın ismi farklı farklı tanımlanabilmektedir. Aşağıda bu isimlere örnek olması açısından bazı giriş sayfası isimleri yazılmıştır.
</p>
<ul>
    <li>
        <em>html</em>
    </li>
    <li>
        <em>htm</em>
    </li>
    <li>
        <em>html</em>
    </li>
    <li>
        <em>htm</em>
    </li>
    <li>
        <em>aspx</em>
    </li>
    <li>
        <em>php</em>
    </li>
</ul>
<p>
Görüldüğü gibi farklı dosya isimleri ve farklı uzantılar kullanılarak giriş sayfaları belirlenebilmektedir. İlgili sunucuda mevcut    <strong>web sitesi</strong> için hangisinin giriş sayfası olduğu belirlemek gerekecektir. Bu işlemden sonra artık giriş sayfası üzerinden siteye girişler
    sorunsuz bir şekilde sağlanabilir.
</p>
<p>
Html gerçek anlamda bir programlama dili olmamasına karşın yine de belli bir sözdizimi ve kullanımı bulunmaktadır. Bu kurallara uyarak    <strong>Html kodları</strong> yazmak gerekir. Peki <strong>Html kodu nedir</strong>? Bir sonraki başlığa geçip <em>Html</em>’in sözdizimine göz atalım.
</p>
<h2>
    Html Kodu Nedir?
</h2>
<p>
    Html ile web sayfaları oluşturmak çok basittir. Bu dil ile web sayfaları oluşturmaya başlayınca günlük konuşma dilini kullanıyormuşçasına sayfalar
    geliştirebilirsiniz. Bu aşamada <strong>css nedir</strong> sorusu da cevaplanması gereken sorulardandır ama şu an konumuz dışında olduğu için
    değinilmeyecektir. Çünkü css başlı başına farklı bir teknolojidir.
</p>
<p>
    Şimdi artık <strong>Html nasıl kullanılır</strong> sorusuna cevap verebiliriz. Bunun için ‘<em>Notepad</em>’ programını kullanmak oldukça pratik bir çözüm
    olacaktır. Zaten Html ile geliştirilen uygulamaların derlenmesine gerek olmaması bu konuda geliştiricilere büyük kolaylık ve avantajlar sağlamaktadır.
</p>
<h3>
    Html Sayfası Oluşturmak
</h3>
<p>
    Bir Html sayfası oluşturmak için küçük ve büyük (&lt; &gt;) işaretlerinden sıkça faydalanacağız. O zaman öncelikle &lt; &gt; işaretlerinin arasına ‘html’
yazmakla başlayalım. Ardından yine (&lt; &gt;) işaretlerini kullanarak <em>html tag</em>’inin içerisine ‘<strong><em>head</em></strong>’ ve ‘<strong><em>body</em></strong>’ <em>tag</em>’lerini yazıyoruz. Burada yazdığımız <em>html, head </em>ve <em>body</em> Html dilinde    <strong><em>tag</em></strong> olarak isimlendirilmektedir.
</p>
<p>
    Şimdi yukarıda bahsettiğimiz durumun kodlarını detaylı bir şekilde aşağıda inceleyelim.
</p>
<p>
    <em>&lt;html&gt;</em>
</p>
<p>
    <em> &lt;head&gt;</em>
</p>
<p>
    <em> &lt;title&gt; İlk HTML Sayfamız &lt;/title&gt;</em>
</p>
<p>
    <em> &lt;/head&gt;</em>
</p>
<p>
    <em> &lt;body&gt;</em>
</p>
<p>
    <em> &lt;font size = "5" face = "Tahoma" color = "gray"&gt; İlk HTML Sayfamız &lt;/font&gt;</em>
</p>
<p>
    <em> &lt;/body&gt;</em>
</p>
<p>
    <em>&lt;/html&gt;</em>
</p>
<p>
Yukarıdaki kodları incelediğimiz zaman iç içe geçmiş bir yapı görmekteyiz. En dışta yukarıda belirttiğimiz <strong>&lt;html&gt; &lt;/html&gt;</strong><em>tag</em>’leri yer alıyor. Sonra gelen <em>tag</em> <strong>&lt;head&gt; &lt;/head&gt;</strong> ve daha sonraki <em>tag</em>    <strong>&lt;body&gt; &lt;/body&gt;</strong>’dir. Head <em>tag</em>’i başlık olarak ifade edilirken, body<em> tag’i </em>gövdeyi temsil eder. Yani bir web
    sayfasının başlıkla ilgili verileri head <em>tag</em>’i içerisine, içerik ve görünümle ilgili olanları ise body tag’i içerisine yazıyoruz.
</p>
<br/>
<img alt="HTML Nedir?" class="img-responsive" title="HTML Nedir?" src="images/html-nedir-1.png">
<br/>
<p>
    Head tag’i içerisinde yer alan <strong>&lt;title&gt; &lt;/title&gt;</strong> <em>tag</em>’i web sayfamızın başlık bilgisini içermektedir. Buraya
yazacağınız başlık tarayıcının en üstünde görünen başlık olacaktır. Yukarıda verilen kodları <em>Notepad</em>’de yazıp farklı kaydet diyerek “    <strong>Kayıt Türü</strong>” kısmından ‘<strong>Tüm Dosyalar</strong>’ seçilir ve dosya adının sonuna ‘<strong>.html</strong>’ eklenir. Artık oluşan
    dosyamız Html uzantılı olacaktır ve herhangi bir tarayıcıda çalıştırdığınızda açılacaktır.
</p>
<h2>
    Html Örnek Uygulama
</h2>
<p>
Yukarıda yazdığımız örnekten biraz daha farklı bir örnek yaparak konunun biraz daha pekişmesini sağlayalım. Bu örneğimizle birlikte kafanızdaki    <strong>Html nedir</strong> sorusu biraz daha cevaplanmış olacaktır. Bu örneğimiz için yine ‘<em>Notepad</em>’ programını kullanacağız.
</p>
<p>
    Örnek uygulamamızda giriş yaptığımız web sayfamızda yer alan bir bağlantı ile farklı bir sayfaya yönlendirme işlemini yapmaya çalışacağız. Öncelikle yeni
bir <em>Notepad</em> açıyoruz ve <strong>&lt;html&gt; &lt;/html&gt;</strong> <em>tag</em>’lerini yazıyoruz. Ardından    <strong>&lt;body&gt; &lt;/body&gt;</strong> <em>tag</em>’leri arasına (Bu örneğimizde <strong>&lt;head&gt; &lt;/head&gt;</strong> <em>tag</em>’lerini
    kullanmayacağız) aşağıdaki komutu yazıyoruz.
</p>
<ul>
    <li>
        <em>&lt;a href = ”ornek_uygulama.html”&gt; Örnek Uygulama Sayfası &lt;/a&gt;</em>
    </li>
</ul>
<p>
    Bu komutla birlikte yapılacak işlem şudur: Web sayfamız içerisinde ‘<strong>Örnek Uygulama Sayfası</strong>’ yazan bir link olacak ve bu linke tıklandığı
    zaman web tarayıcı bizi ‘<strong><em>ornek_uygulama.html</em></strong>’ sayfasına yönlendirecek. Görüldüğü gibi basit bir iki komut ile günlük olarak
    ziyaret ettiğimiz web sitelerinin çalışma mantığını görmüş oluyoruz.
</p>
<p>
    Siz de bu yaptığımız örnek uygulamalara benzer çalışmalar yaparak farklı çalışmalar ortaya koyabilirsiniz.
</p>
<p>
    Html nedir konulu yazımız için yaptığımız basit bir örnek uygulamadan sonra biraz da farklı bilgilere göz atalım.
</p>
<h3>
    Html Viewer Nedir?
</h3>
<p>
    Bu konu daha çok <strong>web programlama dilleri nelerdir</strong>, ne işe yararlar gibi sorulara cevap arayan ve web programlama dünyasına yeni giriş
    yapanların işine yarayacak bir konudur. Peki <strong>Html viewer nedir</strong>? Yalın bir ifade ile açıklayacak olursak, web sayfalarının html dökümlerini
    veren bir uygulamadır. Yani herhangi bir web sayfasının adres bilgisini yazdığınızda size Html kodları veren ve sitede yapılan çalışmaları incelemenize
    olanak sağlayan yapıdır.
</p>
<br/>
<img alt="HTML Nedir?" class="img-responsive" title="HTML Nedir?" src="images/html-nedir-2.png">
<br/>
<p>
    Peki bu bize nasıl bir avantaj sağlayacak? Yukarıda da belirtildiği gibi özellikle yeni başlayanlar için bulunmaz fırsat ve avantajlar içerir. Çünkü günlük
olarak kullanılan web sayfalarında kullanılan yapı ve teknolojilerin incelenmesi ve bu konudaki bilgi dağarcığının artırılması sağlanacaktır. Böylece    <strong>Html nedir</strong> sorusuna daha kapsamlı ve canlı bir sistem üzerinden cevap aranacaktır.
</p>
<h3>
    Html Tarayıcı Nedir?
</h3>
<p>
İngilizce ‘<em>Web Browser</em>’ olarak bilinen ve ‘<em>Web Tarayıcı</em>’ anlamına gelen bu kavram ile sunucularda yer alan ve konumuz dahilinde olan    <strong>Html sayfaları</strong>nın görüntülenmesini sağlayan programlardır. Html olarak hazırlanan sayfaların son kullanıcıların anlayacağı şekilde
    dönüşümü tarayıcılarla sağlanmaktadır. Standart bir web tarayıcıda bulunan genel özellikleri aşağıda görebilirsiniz.
</p>
<ol>
    <li>
        <em>Html ile http arasında bütün protokolleri destekleme</em>
    </li>
    <li>
        <em>Dosya sistemlerini okuma, bağlama ve kaydetme</em>
    </li>
    <li>
        <em>Metin ve çoklu ortam dosyalarını açma, oynatma ve kaydetme</em>
    </li>
    <li>
        <em>Açılan sayfada aranan nesneyi bulma</em>
    </li>
    <li>
        <em>Sık kullanılanlar ve geçmişi tutma</em>
    </li>
    <li>
        <em>Ağa dosya yükleme ve indirme</em>
    </li>
    <li>
        <em>E-Posta ve metin editörleri ile iletişim kurabilme</em>
    </li>
    <li>
        <em>Bağlantı izleme</em>
    </li>
    <li>
        <em>Sayfa çıktısı alma</em>
    </li>
    <li>
        <em>Çevrimdışı kalma</em>
    </li>
</ol>
<p>
    Yukarıda bahsedilen özellikler hemen her <strong>web tarayıcı</strong>da var olan genel özellikler arasındadır.
</p>
<h3>
    Web Tarayıcı Kullanıcı Arabirimleri
</h3>
<p>
    Web tarayıcılarda kullanılan kullanıcı arabirimleri olarak,
</p>
<ul>
    <li>
        İlgili web sayfanın adresini yazmak için <strong>Adres çubuğu</strong>
    </li>
    <li>
        Herhangi bir arama motoru ile ilişkili olacak şekilde <strong>Arama çubuğu</strong>
    </li>
    <li>
        <strong>Ana sayfa</strong>
        , <strong>yenile</strong> ve <strong>dur</strong> butonları
    </li>
    <li>
        Sayfalarda ileri geri geçişleri sağlayan <strong>ileri - geri</strong> butonları
    </li>
    <li>
        Daha önce ziyaret edilen siteleri gösteren <strong>Geçmiş</strong>
    </li>
    <li>
        Ziyaret edilmek istenen sayfanın bağlantı durumlarını gösteren ve sayfayı yakınlaştırmaya yarayan <strong>Durum çubuğu</strong> yazılabilir.
    </li>
</ul>
<br/>
<center><img alt="HTML Nedir?" class="img-responsive" title="HTML Nedir?" src="images/html-nedir-3.jpg"></center>
<br/>
<p>
Günümüzde kullanılan birçok web tarayıcı çeşidi bulunmaktadır. Bunlar arasında en çok kullanılanları <strong><em>Internet Explorer</em></strong>,    <strong><em>Google Chrome</em></strong>, <strong><em>Firefox</em></strong> ve <strong><em>Opera</em></strong>’dır.
</p>
<h2>
    Html Eğitimi
</h2>
<p>
    Bu yazımızda sizlerle "<strong><em>Html nedir?</em>"</strong> sorusuna cevap aradık. Genel tanımlamalardan sonra <strong>Html basit site</strong>
    uygulaması yaparak <strong>Html kodları</strong>n nasıl uygulanabileceğini görmüş olduk. Başlangıç seviyesinde olan bu anlatımla birlikte web tasarımcılar
    ve web programcıların konuya dair farkındalıkları artırılmış olacaktır.
</p>
<p>
    Yapacağınız araştırmalarda özellikle son çalışmalarla birlikte <strong>Html 5 nedir</strong> sorusuna yoğunlaşmanız faydalı olacaktır. Çünkü web dünyasında
    yaşanan gelişmeler, teknoloji dünyasına tablet, akıllı telefon gibi cihazların girmesiyle daha da artmış durumdadır. Bundan dolayı çalışmalarınızı güncel
    gelişmelere yönlendirmeniz sizin açınızdan ileriye dönük olarak yararlı bir davranış olacaktır.
</p>
<br/>
<center><img alt="HTML Nedir?" class="img-responsive" title="HTML Nedir?" src="images/html-nedir-4.png"></center>
<br/>


   <a href="css-nedir"><h2 style="color:rgb(0, 186, 253);">CSS </h2>
               
                
            
            <div class="row wrapper">
                <section id="content" class="col-md-8">
                    <div class="theiaStickySidebar">
                        <article class="panel panel-default">
                            <div class="panel-heading mg-0">
                                <h1 class="panel-title">CSS Hakkında Temel Bilgiler</h1>
                            </div>
                           
                               
   
    <li>
                                    <a href="javascript:void(0);" onclick="doFollow(1)" data-toggle="tooltip" data-placement="right"
                   title="Favorilere Ekle" class="btn btn-success">
                    <i class="fa fa-star-o fa-fw"></i>
                </a>
                        </li>
                                        <div class="text">
                                        <!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><strong>CSS Nedir?</strong><br>
<br>
HTML bize metin bi&ccedil;imlendirme alan&#305;nda &ccedil;ok geni&#351; olanaklar sunar. CSS, uzun yaz&#305;l&#305;&#351;&#305;yla Cascading Style Sheets, veya T&uuml;rk&ccedil;esiyle Stil &#351;ablonlar&#305; ise bunu bir ad&#305;m daha &ouml;teye g&ouml;t&uuml;r&uuml;r, bize sayfalar&#305;m&#305;z i&ccedil;in global &#351;ablonlar haz&#305;rlama olana&#287;&#305; verdi&#287;i gibi, tek bir harfin stilini; yani renk,  font, b&uuml;y&uuml;kl&uuml;k gibi &ouml;zelliklerini de&#287;i&#351;tirmek i&ccedil;in de kullan&#305;labilir. Bu tekni&#287;in en &ouml;nemli &ouml;zelli&#287;i kullan&#305;m&#305;ndaki bu esnekli&#287;idir.<br>
<br>
Bir web sayfas&#305; i&ccedil;erisinde zaten estetik kurallar&#305; gere&#287;i y&uuml;zlerce renk ve font kullanmay&#305;z. Genelde birbiriyle uyumlu birka&ccedil; renk ve birka&ccedil; font kullan&#305;r&#305;z ki, bunlar&#305; her sayfada ayr&#305; ayr&#305; tekrar belirtmek yerine CSS yard&#305;m&#305;yla bir sefer tan&#305;mlay&#305;p b&uuml;t&uuml;n web sayfam&#305;zda kullanabiliriz.Bu &#351;ekilde g&uuml;ncelleme yaparken de onlarca sayfay&#305; de&#287;i&#351;tirmekten kurtuluruz.<br>
<br>
CSS kodlar&#305; HTML kodlar&#305;n&#305;n i&ccedil;ine yaz&#305;l&#305;rlar. T&uuml;r&uuml;ne g&ouml;re body veya head b&ouml;l&uuml;mlerinde yer alabilirler. Bunlar&#305;n d&#305;&#351;&#305;nda harici CSS dosyalar&#305; olu&#351;turulup bunlar gerekti&#287;inde HTML belgesi i&ccedil;erisinde &ccedil;a&#287;&#305;r&#305;labilirler.<br>
<br>
Hemen hemen her konuda oldu&#287;u gibi CSS konusunda da Microsoft Internet Explorer ve Firefox farkl&#305; yorumlar ortaya koyarlar. Bu noktada her iki browser'&#305;n da ayn&#305;/benzer yorumlayaca&#287;&#305; kodlar yazmak en uygunudur.<br>
<br>
<strong>L&#304;NK &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>a:</strong> Linkin, sayfa a&ccedil;&#305;ld&#305;&#287;&#305;nda t&#305;klanmadan veya &uuml;mle&ccedil; &uuml;zerine getirilmeden &ouml;nceki durumudur.<br>
<strong>a:hover :</strong> Linkin imle&ccedil; &uuml;zerine getirildi&#287;indeki durumudur.<br>
<strong>a:active :</strong> Linkin t&#305;kland&#305;&#287;&#305; andaki durumudur.<br>
<strong>a:visited :</strong> Linkin t&#305;kland&#305;ktan sonraki durumudur.B&#304;&Ccedil;<br>
<strong>color:</strong> Linkin rengini belirler.<br>
<strong>background-color:</strong> Linkin zemin rengini belirler.<br>
<strong>background-image:</strong> Linkin zeminine resim ekler(Bu animated-gif de olabilir.)<br>
<strong>text-decoration:</strong> Linkin alt&#305;n&#305;n,&uuml;st&uuml;n&uuml;n vs. &ccedil;izgili olup olmayaca&#287;&#305;n&#305; belirler.<br>
<strong>font-weight:</strong> Yaz&#305;n&#305;n kal&#305;nl&#305;k veya inceli&#287;ini belirler.<br>
<strong>border:</strong> Linkin etraf&#305;na kenarl&#305;k ekler.<br>
<strong>display:</strong> Linki i&ccedil;eren h&uuml;cre , sat&#305;r vb. istenilen alan&#305;n se&ccedil;ilmesini sa&#287;lar.<br>
<br>
<strong>L&#304;STE &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>disk:</strong> Liste bi&ccedil;iminin disk (i&ccedil;i dolu daire) &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>circle :</strong> Liste bi&ccedil;iminin &ccedil;ember &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>square :</strong> Liste bi&ccedil;iminin kare olmas&#305;n&#305; sa&#287;lar.<br>
<strong>decimal :</strong> Liste bi&ccedil;iminin rakamlardan olu&#351;mas&#305;n&#305; sa&#287;lar.<br>
<strong>lower-roman :</strong> Liste bi&ccedil;iminin i,ii,iii gibi k&uuml;&ccedil;&uuml;k roma rakamlar&#305;ndan olu&#351;mas&#305;n&#305; sa&#287;lar.<br>
<strong>upper-roman :</strong> Liste bi&ccedil;iminin I,II,II gibi b&uuml;y&uuml;k roma rakamlar&#305;ndan olu&#351;mas&#305;n&#305; sa&#287;lar.<br>
<strong>lower-alpha :</strong> Liste bi&ccedil;iminin a,b,c &#351;eklinde k&uuml;&ccedil;&uuml;k harf olmas&#305;n&#305; sa&#287;lar.<br>
<strong>upper-alpha :</strong> Liste bi&ccedil;iminin A,B,C &#351;eklinde b&uuml;y&uuml;k harf olmas&#305;n&#305; sa&#287;lar.<br>
<strong>none :</strong> Listenin simgesiz olmas&#305;n&#305; sa&#287;lar.<br>
<strong>inside :</strong> Listenin ikinci sat&#305;r&#305;n&#305;n en soldan ba&#351;lamas&#305;n&#305; sa&#287;lar.<br>
<strong>Outside :</strong> Listenin ikinci sat&#305;r&#305;n&#305;n ilk sat&#305;r ile ayn&#305; yerden ba&#351;lamas&#305;n&#305; sa&#287;lar.<br>
<strong>list-style-image :</strong> Liste bi&ccedil;iminin resim olmas&#305;n&#305; sa&#287;lar.<br>
<br>
<strong>KATMAN &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>position:</strong> Katman&#305;n yerinin belirlenmesini sa&#287;lar.<br>
<strong>absolute:</strong> Katman&#305;n yerinin pencere esas al&#305;narak belirlenmesini sa&#287;lar.<br>
<strong>relative:</strong> Katman&#305;n yerinin bir &ouml;nceki katman esas al&#305;narak belirlenmesini sa&#287;lar.<br>
<strong>static:</strong> Katman&#305;n yerinin sabit olarak (Varsay&#305;lan olan sol &uuml;st k&ouml;&#351;e) belirlenmesini sa&#287;lar.<br>
<strong>top:</strong> Katman&#305;n &uuml;stten ne kadar a&#351;a&#287;&#305;da olmas&#305; gerekti&#287;ini belirler.<br>
<strong>left:</strong> Katman&#305;n soldan ne kadar i&ccedil;eride olmas&#305; gerekti&#287;ini belirler.<br>
<strong>width:</strong> Katman&#305;n geni&#351;li&#287;inin ne kadar olaca&#287;&#305;n&#305; belirler.<br>
<strong>height:</strong> Katman&#305;n y&uuml;ksekli&#287;inin ne kadar olaca&#287;&#305;n&#305; belirler.<br>
<strong>overflow:</strong> Katman&#305;n belirtilen y&uuml;kseklik ve geni&#351;li&#287;e s&#305;&#287;mayan k&#305;sm&#305;na ne olaca&#287;&#305;n&#305; belirler.<br>
<strong>auto: </strong>Otomatik olarak belirlenir.<br>
<strong>scroll: </strong>Kayd&#305;rma &ccedil;ubu&#287;u ekleyerek g&ouml;r&uuml;nmesini sa&#287;lar.<br>
<strong>visible :</strong> Katman&#305; belirtilen boyutlar&#305;n d&#305;&#351;&#305;na ta&#351;&#305;rarak s&#305;&#287;mayan yerlerin g&ouml;r&uuml;nmesini sa&#287;lar.<br>
<strong>hidden:</strong> S&#305;&#287;mayan yerleri gizler.<br>
<strong>visibility:</strong> Katman&#305;n g&ouml;r&uuml;nebilirlik ayar&#305;n&#305; yapar.<br>
<strong>visible :</strong> Katman&#305;n g&ouml;r&uuml;n&uuml;r olmas&#305;n&#305; sa&#287;lar.<br>
<strong>hidden:</strong> Katman&#305; gizler.<br>
<strong>z-index :</strong> Katmanlar&#305;n alttan &uuml;ste do&#287;ru hangi s&#305;ra ile g&ouml;sterilece&#287;ini belirler.1 de&#287;eri katman&#305;n en altta olaca&#287;&#305;n&#305; belirtir.<br>
<br>
<strong>FONT &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>font-family: </strong>Yaz&#305; t&uuml;r&uuml;n&uuml; belirler.(Arial , Verdana gibi.)<br>
<strong>font-style:</strong> Yaz&#305;n&#305;n normal veya sa&#287;a e&#287;ik olmas&#305;n&#305; sa&#287;lar.<br>
<strong>font-variant:</strong> Yaz&#305;n&#305;n normal veya t&uuml;m&uuml;n&uuml;n b&uuml;y&uuml;k harflerden olu&#351;mu&#351; olmas&#305;n&#305; sa&#287;lar.<br>
<strong>font-weight:</strong> Yaz&#305;n&#305;n kal&#305;nl&#305;k-inceli&#287;ini belirler.<br>
<strong>font-size:</strong> Yaz&#305;n&#305;n b&uuml;y&uuml;kl&uuml;&#287;&uuml;n&uuml; belirler.<br>
<br>
<strong>TEXT &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>word-spacing : </strong>Kelimeler aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u bo&#351;lu&#287;u belirler.<br>
<strong>letter-spacing :</strong> Harfler aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u bo&#351;lu&#287;u belirler.<br>
<strong>text-decoration :</strong> Kelimenin alt&#305;n&#305;n , &uuml;st&uuml;n&uuml;n vs. &ccedil;izili olup olmayaca&#287;&#305;n&#305; belirler.<br>
<strong>underline :</strong> Kelimenin alt&#305;n&#305;n (Sat&#305;r alt&#305;ndan) &ccedil;izili olmas&#305;n&#305; sa&#287;lar.<br>
<strong>overline : </strong>Kelimenin &uuml;st&uuml;n&uuml;n (Sat&#305;r &uuml;st&uuml;nden) &ccedil;izili olmas&#305;n&#305; sa&#287;lar.<br>
<strong>line-through : </strong>Kelimenin ortas&#305;ndan &ccedil;izili olmas&#305;n&#305; sa&#287;lar.<br>
<strong>blink : </strong>Kelimenin yan&#305;p s&ouml;nmesini sa&#287;lar.(Netscape i&ccedil;in)<br>
<strong>vertical-align :</strong> Metnin yatay olarak nas&#305;l hizalanaca&#287;&#305;n&#305; belirler.<br>
<strong>text-transform: </strong>Kelimelerin b&uuml;y&uuml;k harf veya k&uuml;&ccedil;&uuml;k harflerden olu&#351;mas&#305;n&#305; sa&#287;lar.<br>
<strong>capitalize :</strong> Kelimelerin ilk harflerinin b&uuml;y&uuml;k olmas&#305;n&#305; sa&#287;lar.<br>
<strong>uppercase :</strong> Kelimelerin b&uuml;t&uuml;n harflerinin b&uuml;y&uuml;k olmas&#305;n&#305; sa&#287;lar.<br>
<strong>lowercase :</strong> Kelimelerin b&uuml;t&uuml;n harflerinin k&uuml;&ccedil;&uuml;k olmas&#305;n&#305; sa&#287;lar.<br>
<strong>none :</strong> Kelimelerin orjinal metindeki gibi olmas&#305;n&#305; sa&#287;lar.<br>
<strong>text-align:</strong> Metnin dikey olarak nas&#305;l hizalanaca&#287;&#305;n&#305; belirler.<br>
<strong>left :</strong> Metni sola yaslar.<br>
<strong>right :</strong> Metni sa&#287;a yaslar.<br>
<strong>center : </strong>Metni ortalar.<br>
<strong>justify :</strong> Metni iki yana yaslar.<br>
<strong>text-indent :</strong> Metnin ilk sat&#305;r&#305;n&#305;n soldan ne kadar i&ccedil;erden ba&#351;layaca&#287;&#305;n&#305; belirler.<br>
<strong>line-height : </strong>Sat&#305;r&#305;n y&uuml;ksekli&#287;ini ayarlar.(Y&uuml;ksek de&#287;er verildi&#287;inde sat&#305;rlar aras&#305;ndaki bo&#351;luk artar.)<br>
<strong>first-line :</strong> Metnin ilk sat&#305;r&#305;n&#305;n bi&ccedil;imlendirilmesini sa&#287;lar.<br>
<strong>first-letter :</strong> Metnin ilk harfinin bi&ccedil;imlendirilmesini sa&#287;lar.<br>
<br>
<strong>&#304;MLE&Ccedil; &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>crosshair:</strong> &#304;mlecin art&#305; i&#351;areti &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>auto:</strong> &#304;mlecin metinde dikey &ccedil;izgi ,bo&#351; alanda normal ok &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>default:</strong> &#304;mlecin hem metinde hem de bo&#351; alanda normal ok &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>hand:</strong> &#304;mlecin linkte oldu&#287;u gibi el &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>move:</strong> &#304;mlecin ta&#351;&#305;ma i&#351;areti &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>ne-resize:</strong> &#304;mlecin sa&#287;a yat&#305;k normal ok olmas&#305;n&#305; sa&#287;lar.<br>
<strong>nw-resize:</strong> &#304;mlecin sola yat&#305;k normal ok olmas&#305;n&#305; sa&#287;lar.<br>
<strong>se-resize: </strong>&#304;mlecin yukardan a&#351;a&#287;&#305; do&#287;ru ve sa&#287;a yat&#305;k normal ok olmas&#305;n&#305; sa&#287;lar.<br>
<strong>sw-resize:</strong> &#304;mlecin yukardan a&#351;a&#287;&#305; do&#287;ru ve sola yat&#305;k normal ok olmas&#305;n&#305; sa&#287;lar.<br>
<strong>n-resize:</strong> &#304;mlecin a&#351;a&#287;&#305;dan yukar&#305;ya do&#287;ru ince ok &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>s-resize:</strong> &#304;mlecin yukardan a&#351;a&#287;&#305; do&#287;ru ince ok &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>w-resize:</strong> &#304;mlecin sola do&#287;ru ince ok &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>e-resize:</strong> &#304;mlecin sa&#287;a do&#287;ru ince ok &#351;eklinde olmas&#305;n&#305; sa&#287;lar.<br>
<strong>text:</strong> &#304;mlecin hem metinde hem de bo&#351; alanda metinde oldu&#287;u gibi g&ouml;r&uuml;nmesini sa&#287;lar.<br>
<strong>wait:</strong> &#304;mlecin me&#351;gul animasyonuna d&ouml;n&uuml;&#351;mesini sa&#287;lar.<br>
<strong>help:</strong> &#304;mlecin yard&#305;m-soru i&#351;aretine d&ouml;n&uuml;&#351;mesini sa&#287;lar<br>
<br>
<strong>ZEM&#304;N &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>background-color: </strong>Zeminin rengini belirler.<br>
<strong>#color :</strong> Renk ad&#305;.<br>
<strong>transparent:</strong> Zeminin saydam olmas&#305;n&#305; sa&#287;lar.<br>
<strong>background-image:</strong> Zemine resim yerle&#351;tirilmesini sa&#287;lar.<br>
<strong>url : </strong>Zemine yerle&#351;tirilen resmin adresi.<br>
<strong>background-repeat:</strong> Zemine yerle&#351;tirilen resmin nas&#305;l yay&#305;laca&#287;&#305;n&#305; belirler.<br>
<strong>repeat :</strong> Resmin b&uuml;t&uuml;n zemine yay&#305;lmas&#305;n&#305; sa&#287;lar.<br>
<strong>repeat-x : </strong>Resmin sol-&uuml;stten sa&#287;-&uuml;ste do&#287;ru yay&#305;lmas&#305;n&#305; sa&#287;lar.<br>
<strong>repeat-y :</strong> Resmin sol-&uuml;stten sol-alta do&#287;ru yay&#305;lmas&#305;n&#305; sa&#287;lar.<br>
<strong>no-repeat:</strong> Resmin yay&#305;lmadan orjinal boyutuyla g&ouml;r&uuml;nmesini sa&#287;lar.<br>
<strong>background-attachment:</strong> Zemindeki resmin , sayfa kayd&#305;rma &ccedil;ubu&#287;uyla hareket ettirildi&#287;indeki durumunu belirler.<br>
<strong>scroll :</strong> Sayfa hareket ettirildi&#287;inde zeminin de kaymas&#305;n&#305; sa&#287;lar.<br>
<strong>fixed:</strong> Sayfa kayd&#305;r&#305;lsa da zeminin sabit kalmas&#305;n&#305; sa&#287;lar<br>
background-position: Zemindeki resmin istenilen &#351;ekilde yerle&#351;tirilmesini sa&#287;lar.<br>
<strong>top : </strong>Resmi yukar&#305; yerle&#351;tirir.<br>
<strong>center : </strong>Resmi ortalar.<br>
<strong>bottom :</strong> Resmi a&#351;a&#287;&#305; yerle&#351;tirir.<br>
<strong>left : </strong>Resmi sola yerle&#351;tirir.<br>
<strong>right:</strong> Resmi sa&#287;a yerle&#351;tirir.<br>
<strong>&hellip;px :</strong> Resmin soldan istenilen &ouml;l&ccedil;&uuml;de i&ccedil;erde olmas&#305;n&#305; sa&#287;lar.<br>
<br>
<strong>TABLO &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>margin : </strong>Tablo ile pencerenin kenarlar&#305; aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>margin-top :</strong> Tablo ile pencerenin &uuml;st kenar&#305; aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>margin-right :</strong> Tablo ile pencerenin sa&#287; kenar&#305; aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>margin-bottom :</strong> Tablo ile pencerenin alt kenar&#305; aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>margin-left :</strong> Tablo ile pencerenin sol kenar&#305; aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<br>
<strong>padding :</strong> Tablo kenarlar&#305; ile tablo i&ccedil;eri&#287;i (Yaz&#305; vb.) aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>padding-top :</strong> Tablonun &uuml;st kenar&#305; ile tablo i&ccedil;eri&#287;i aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>padding-right : </strong>Tablonun sa&#287; kenar&#305; ile tablo i&ccedil;eri&#287;i aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>padding-bottom :</strong> Tablonun alt kenar&#305; ile tablo i&ccedil;eri&#287;i aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<strong>padding-left :</strong> Tablonun sol kenar&#305; ile tablo i&ccedil;eri&#287;i aras&#305;nda b&#305;rak&#305;lacak bo&#351;lu&#287;u belirler.<br>
<br>
<strong>border : </strong>Tablonun kenarlar&#305;n&#305;n &#351;ekillendirilmesini sa&#287;lar.<br>
<br>
<strong>border-top :</strong> Tablonun &uuml;st kenar&#305;n&#305;n &#351;ekillendirilmesini sa&#287;lar.<br>
<strong>border-left :</strong> Tablonun sol kenar&#305;n&#305;n &#351;ekillendirilmesini sa&#287;lar.<br>
<strong>border-bottom :</strong> Tablonun alt kenar&#305;n&#305;n &#351;ekillendirilmesini sa&#287;lar.<br>
<strong>border-right :</strong> Tablonun sa&#287; kenar&#305;n&#305;n &#351;ekillendirilmesini sa&#287;lar.<br>
<br>
<strong>border-width :</strong> Tablonun kenarlar&#305;n&#305;n kal&#305;nl&#305;&#287;&#305;n&#305; belirler.<br>
<strong>border-top-width :</strong> Tablonun &uuml;st kenar&#305;n&#305;n kal&#305;nl&#305;&#287;&#305;n&#305; belirler.<br>
<strong>border-right-width :</strong> Tablonun sa&#287; kenar&#305;n&#305;n kal&#305;nl&#305;&#287;&#305;n&#305; belirler.<br>
<strong>border-bottom-width : </strong>Tablonun alt kenar&#305;n&#305;n kal&#305;nl&#305;&#287;&#305;n&#305; belirler.<br>
<strong>border-left-width :</strong> Tablonun sol kenar&#305;n&#305;n kal&#305;nl&#305;&#287;&#305;n&#305; belirler.<br>
<br>
<strong>border-style :</strong> Tablonun kenarl&#305;k t&uuml;r&uuml;n&uuml; belirler.<br>
<strong>border-top-style : </strong>Tablonun &uuml;st kenarl&#305;k t&uuml;r&uuml;n&uuml; belirler.<br>
<strong>border-right-style : </strong>Tablonun sa&#287; kenarl&#305;k t&uuml;r&uuml;n&uuml; belirler.<br>
<strong>border-bottom-style :</strong> Tablonun alt kenarl&#305;k t&uuml;r&uuml;n&uuml; belirler.<br>
<strong>border-left-style :</strong> Tablonun sol kenarl&#305;k t&uuml;r&uuml;n&uuml; belirler.<br>
<br>
<strong>border-color :</strong> Tablonun kenarlar&#305;n&#305;n rengini belirler.<br>
<strong>border-top-color :</strong> Tablonun &uuml;st kenar&#305;n&#305;n rengini belirler.<br>
<strong>border-right-color :</strong> Tablonun sa&#287; kenar&#305;n&#305;n rengini belirler.<br>
<strong>border-bottom-color :</strong> Tablonun alt kenar&#305;n&#305;n rengini belirler.<br>
<strong>border-left-color : </strong>Tablonun sol kenar&#305;n&#305;n rengini belirler.<br>
<br>
<strong>color :</strong> Tabloda ge&ccedil;en metnin rengini belirler.<br>
<br>
<strong>width : </strong>Tablonon geni&#351;li&#287;ini belirler.<br>
<br>
<strong>height :</strong> Tablonun y&uuml;ksekli&#287;ini belirler.<br>
<br>
<strong>NOT: </strong>Ba&#351;l&#305;k "TABLO" olarak verildi Ancak bu nitelikler ba&#351;ta TD, TR , TH vs. olmak &uuml;zere hemen her etiket i&ccedil;in kullan&#305;labilir.CSS' yi &ouml;zel k&#305;lan da zaten bu&hellip;<br>
<br>
<strong>KAYDIRMA &Ccedil;UBU?U &Ouml;ZELL&#304;KLER&#304;</strong><br>
<br>
<strong>scrollbar-face-color :</strong> Kayd&#305;rma &ccedil;ubu&#287;unun y&uuml;zey rengi , ayn&#305; zamanda zemini de etkiliyor.<br>
<strong>scrollbar-base-color :</strong> Kayd&#305;rma &ccedil;ubu&#287;ununun sol ve &uuml;st kenarl&#305;klar&#305;n&#305; &ccedil;izgi halinde kapl&#305;yor.<br>
<strong>scrollbar-shadow-color :</strong> Sa&#287; ve alt kenarl&#305;klar&#305;n g&ouml;lge rengi.<br>
<strong>scrollbar-highlight-color :</strong> Sol ve &uuml;st kenarl&#305;klar&#305;n g&ouml;lge rengi,ayn&#305; zamanda zemini de etkiliyor.<br>
<strong>scrollbar-arrow-color :</strong> Y&ouml;n oklar&#305;n&#305;n rengi<br>
<br>
Kayd&#305;rma &ccedil;ubu&#287;u, sadece Internet Explorer'da ge&ccedil;erlidir.</body></html>
                                    </div>
                                </div>
                                                              

</script>
<!-- Scripts -// -->
</body></html>
	</body>	

</html>





